<a href="https://colab.research.google.com/github/vigneshlakshh/nlp-tutorials/blob/main/GPT3v2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**TEXT TO SQL USING GPT3**

In [48]:

!pip install openai

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting openai
  Downloading openai-0.26.5.tar.gz (55 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 55.5/55.5 KB 2.2 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Requirement already satisfied: tqdm in /usr/local/lib/python3.8/dist-packages (from openai) (4.64.1)
Requirement already satisfied: aiohttp in /usr/local/lib/python3.8/dist-packages (from openai) (3.8.4)
Requirement already satisfied: requests>=2.20 in /usr/local/lib/python3.8/dist-packages (from openai) (2.25.1)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /usr/local/lib/python3.8/dist-packages (from requests>=2.20->openai) (1.24.3)
Requirement already satisfied: chardet<5,>=3.0.2 in /usr/local/lib/python3.8/dist-packages (from requests>=2.20->openai) (4.0.0)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.8/dist-packages (from requests>=2.20->openai) (2022.12.7)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.8/dist-packages (from requests>=2.20->openai) (2.10)
Requirement already satisfied: yarl<2.0,>=1.0 in /usr/local/lib/python3.8/dist-packages (from aiohttp->openai) (1.8.2)
Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.8/dist-packages (from aiohttp->openai) (1.3.3)
Requirement already satisfied: aiosignal>=1.1.2 in /usr/local/lib/python3.8/dist-packages (from aiohttp->openai) (1.3.1)
Requirement already satisfied: charset-normalizer<4.0,>=2.0 in /usr/local/lib/python3.8/dist-packages (from aiohttp->openai) (3.0.1)
Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.8/dist-packages (from aiohttp->openai) (6.0.4)
Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.8/dist-packages (from aiohttp->openai) (22.2.0)
Requirement already satisfied: async-timeout<5.0,>=4.0.0a3 in /usr/local/lib/python3.8/dist-packages (from aiohttp->openai) (4.0.2)
Building wheels for collected packages: openai
  Building wheel for openai (pyproject.toml) ... done
  Created wheel for openai: filename=openai-0.26.5-py3-none-any.whl size=67620 sha256=e2642ffcbd9ed053f611a9aeb74e1023c0808ad456f85c14063a93f7a3879f12
  Stored in directory: /root/.cache/pip/wheels/a7/47/99/8273a59fbd59c303e8ff175416d5c1c9c03a2e83ebf7525a99
Successfully built openai
Installing collected packages: openai
Successfully installed openai-0.26.5

**IMPORTING**

In [49]:

import json
import openai

In [50]:

openai.api_key = "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"

In [52]:
from gpt import GPT
from gpt import Example

**MODEL**

In [53]:
gpt = GPT(engine="davinci",temperature=0.5,max_tokens=100) #creating instance

**TRAINING**

In [54]:
gpt.add_example(Example('Fetch unique values of DEPARTMENT from Worker table.', 
                        'Select distinct DEPARTMENT from Worker;'))

In [55]:
gpt.add_example(Example('Print the first three characters of FIRST_NAME from Worker table.', 
                        'Select substring(FIRST_NAME,1,3) from Worker;'))

In [ ]:

gpt.add_example(Example("Find the position of the alphabet ('a') in the first name column 'Amitabh' from Worker table.", 
                        "Select INSTR(FIRST_NAME, BINARY'a') from Worker where FIRST_NAME = 'Amitabh';"))

In [ ]:
gpt.add_example(Example("Print the FIRST_NAME from Worker table after replacing 'a' with 'A'.", 
                        "Select CONCAT(FIRST_NAME, ' ', LAST_NAME) AS 'COMPLETE_NAME' from Worker;"))

In [ ]:

gpt.add_example(Example("Display the second highest salary from the Worker table.", 
                        "Select max(Salary) from Worker where Salary not in (Select max(Salary) from Worker);"))

In [ ]:
gpt.add_example(Example("Display the highest salary from the Worker table.", 
                        "Select max(Salary) from Worker;"))

In [ ]:
gpt.add_example(Example("Fetch the count of employees working in the department Admin.", 
                        "SELECT COUNT(*) FROM worker WHERE DEPARTMENT = 'Admin';"))

In [ ]:
gpt.add_example(Example("Get all details of the Workers whose SALARY lies between 100000 and 500000.", 
                        "Select * from Worker where SALARY between 100000 and 500000;"))

In [ ]:
gpt.add_example(Example("Get Salary details of the Workers", 
                        "Select Salary from Worker"))

In [ ]:
gpt.add_example(Example(' What are the first 10 records in a table ', ' SELECT *FROM table_name LIMIT 10;'))

In [ ]:
gpt.add_example(Example('filter records based on a specific condition', ' SELECT *FROM table_name WHERE condition;'))

In [ ]:
gpt.add_example(Example('join two tables together on common field ', 'SELECT *FROM table1 JOIN table2 ON table1.column = table2.column;'))

In [ ]:
gpt.add_example(Example('count the number of records in a table ', ' SELECT COUNT(*)FROM table_name;'))

In [ ]:
gpt.add_example(Example(' group records based on a specific column ', ' SELECT column_name, COUNT(*) FROM table_name GROUP BY column_name;'))

In [ ]:
gpt.add_example(Example(' find the maximum value in a column ', ' SELECT MAX(column_name) FROM table_name;'))

In [ ]:
gpt.add_example(Example(' find the minimum value in a column ', ' SELECT MIN(column_name) FROM table_name;'))

In [ ]:
gpt.add_example(Example(' calculate the average value of a column ', ' SELECT AVG(column_name) FROM table_name;'))

In [ ]:
gpt.add_example(Example(' sort records in a table based on a specific column ', ' SELECT *FROM table_name ORDER BY column_name;'))

In [ ]:
gpt.add_example(Example(' sort records in a table based on a specific column ', ' SELECT *FROM table_name ORDER BY column_name;'))

In [ ]:
gpt.add_example(Example(' insert a new record into a table ', ' INSERT INTO table_name (column1, column2, ...)VALUES (value1, value2, ...);'))

In [ ]:
gpt.add_example(Example(' update an existing record in a table ', ' UPDATE table_name SET column_name = new_value WHERE condition;'))

In [ ]:
gpt.add_example(Example(' update an existing record in a table ', ' UPDATE table_name SET column_name = new_value WHERE condition;'))

In [ ]:
gpt.add_example(Example(' find the top 5 most frequent values in a column', 'SELECT column_name, COUNT(*) as count FROM table_name GROUP BY column_name ORDER BY count DESC LIMIT 5;'))

In [ ]:
gpt.add_example(Example('find the records in a table that have the maximum value in a column', 'SELECT * FROM table_name WHERE column_name = (SELECT MAX(column_name) FROM table_name);'))

In [ ]:
gpt.add_example(Example('calculate the running total of a column over time', 'SELECT date, sales, SUM(sales) OVER (ORDER BY date) AS running_total FROM table_name;'))

In [ ]:
gpt.add_example(Example('join three tables together', 'SELECT *FROM table1 JOIN table2 ON table1.column1 = table2.column1 JOIN table3 ON table2.column2 = table3.column2;'))

In [ ]:
gpt.add_example(Example('join two tables and return the records that dont match on a specific condition', 'SELECT * FROM table1 LEFT JOIN table2 ON table1.column1 = table2.column1 WHERE table2.column1 IS NULL;'))

In [ ]:
gpt.add_example(Example('join two tables and return only the most recent record from the second table for each record in the first table', 'SELECT * FROM table1 LEFT JOIN ( SELECT column1, MAX(column2) AS max_column2 FROM table2 GROUP BY column1) AS latest_table2 ON table1.column1 = latest_table2.column1 AND table2.column2 = latest_table2.max_column2;'))

In [ ]:
gpt.add_example(Example('join two tables and calculate the percentage of records in each table that have a matching record in the other table', ' SELECT COUNT(DISTINCT table1.id) / COUNT(DISTINCT table2.id) AS match_percentage FROM table1 JOIN table2 ON table1.column1 = table2.column1; SELECT COUNT(DISTINCT table2.id) / COUNT(DISTINCT table1.id) AS match_percentage FROM table2 JOIN table1 ON table1.column1 = table2.column1;'))

In [ ]:
gpt.add_example(Example('sort records in ascending order', 'SELECT * FROM table_name ORDER BY column1 ASC;'))

In [ ]:
gpt.add_example(Example('sort records in decending order', 'SELECT * FROM table_name ORDER BY column1 DESC;'))

In [ ]:
gpt.add_example(Example('group records based on a specific column and calculate an aggregate function', 'SELECT column1, COUNT(*) FROM table_name GROUP BY column1;'))

In [ ]:
gpt.add_example(Example('select the top N records from a table', 'SELECT * FROM table_name LIMIT N;'))

In [ ]:
gpt.add_example(Example(' select records from a table that have a value in a list of values', "SELECT * FROM table_name WHERE column1 IN ('value1', 'value2', 'value3');"))

In [ ]:
gpt.add_example(Example('select records from a table that have a value between two values', 'SELECT * FROM table_name WHERE column1 BETWEEN value1 AND value2;'))

In [ ]:
gpt.add_example(Example('subquery to filter records', "SELECT * FROM table1 WHERE column1 IN (SELECT column1 FROM table2 WHERE column2 = 'value');"))

In [ ]:
gpt.add_example(Example('update a record in a table', "INSERT INTO table_name (column1, column2, column3) VALUES ('value1', 'value2', 'value3');"))

In [ ]:
gpt.add_example(Example('create a new table in a database', 'CREATE TABLE table_name (column1 datatype, column2 datatype,column3 datatype);'))

In [ ]:
gpt.add_example(Example('drop a table from a database', 'DROP TABLE table_name;'))

**TESTING**

In [56]:
prompt = "Display the lowest salary from the Worker table."

In [57]:
output = gpt.submit_request(prompt)

In [ ]:
output.choices[0].text

'output: Select min(Salary) from Worker;\n'

In [ ]:

prompt = "Tell me the count of employees working in the department HR."

In [ ]:

output = gpt.submit_request(prompt)

In [ ]:

output.choices[0].text

"output: SELECT COUNT(*) FROM worker WHERE DEPARTMENT = 'HR';\n"

In [ ]:

prompt = "Get salary details of the Workers whose AGE lies between 25 and 35"

In [ ]:

print(gpt.get_top_reply(prompt))

output: Select Salary from Worker where AGE between 25 and 35

In [ ]:
prompt = "join three tables"

In [ ]:
print(gpt.get_top_reply(prompt))

output: SELECT *FROM table1 LEFT JOIN table2 ON table1.column = table2.column LEFT JOIN table3 ON table2.column = table3.column;

In [ ]:
prompt = "create new table with three columns id, name, number with id as primary key "

In [ ]:
print(gpt.get_top_reply(prompt))

output:  CREATE TABLE table_name ( id INT NOT NULL AUTO_INCREMENT PRIMARY KEY, name CHAR(20), number INT );
output: INSERT INTO table_name VALUES (NULL, 'Amitabh', 1); INSERT INTO table_name VALUES (NULL, 'Shahrukh', 2); INSERT INTO table_name VALUES (NULL, 'Salman', 3);
output: SELECT * FROM table_name

In [ ]:
prompt = "perform left join with two tables "

In [ ]:
print(gpt.get_top_reply(prompt))

output: SELECT * FROM table1 LEFT JOIN table2 ON table1.column1 = table2.column1 AND table2.column2 IS NULL;

In [ ]:
prompt="SQL query to fetch all the employees who either live in California or work under a manager with ManagerId – 321"

In [ ]:
print(gpt.get_top_reply(prompt))

select e.EmployeeId, e.LastName, e.FirstName, e.Address, e.City, e.State, e.ZipCode, m.ManagerId, m.LastName, m.FirstName, m.Address, m.City, m.State, m.ZipCode from Employees e join Managers m on e.ManagerId = m.ManagerId where e.State = 'CA' or (e.ManagerId = 321)

In [ ]:
prompt="select records from a table that have a value in a list of values in USA,INDIA, CANADA, AUSTRALIA"

In [ ]:
print(gpt.get_top_reply(prompt))

output: SELECT * FROM table_name WHERE column1 IN ('USA','INDIA','CANADA','AUSTRALIA');

In [ ]:
prompt=" "

In [ ]:
print(gpt.get_top_reply(prompt))

In [ ]:
prompt=" "

In [ ]:
print(gpt.get_top_reply(prompt))

In [2]:
!pip install mysql-connector-python

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting mysql-connector-python
  Downloading mysql_connector_python-8.0.32-cp38-cp38-manylinux1_x86_64.whl (23.5 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 23.5/23.5 MB 33.1 MB/s eta 0:00:00
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in /usr/local/lib/python3.8/dist-packages (from mysql-connector-python) (3.19.6)
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.0.32

In [3]:
import mysql.connector as mysql

In [12]:
myconn = mysql.connect(host='3307',user='root', password='root',database='moviesdb')

DatabaseError: ignored

In [19]:
import sqlite3

In [20]:
conn=sqlite3.connect("test.db")

In [22]:
conn.execute('''
CREATE TABLE DEPT(
  Code INTEGER PRIMARY KEY NOT NULL,
  Name NVARCHAR NOT NULL,
  Budget REAL NOT NULL
  );'''
)
conn.commit()
print("DEPT TABLE CREATED");

DEPT TABLE CREATED

In [24]:
conn.execute('''
CREATE TABLE EMP(
  SSN INTEGER PRIMARY KEY NOT NULL,
  Name TEXT NOT NULL,
  Lname VARCHAR NOT NULL,
  Department INTEGER NOT NULL,
  Salary INTEGER NOT NULL,
  CONSTRAINT fk_DEPT_Code FOREIGN KEY(Department)
  REFERENCES DEPT(Code)
  );'''
)
conn.commit()
print("EMP TABLE CREATED");

EMP TABLE CREATED

In [31]:
conn.execute("INSERT INTO DEPT(Code,Name,Budget)VALUES(23,'CSE',222222);")
conn.execute("INSERT INTO DEPT(Code,Name,Budget)VALUES(19,'DS',115000);")
conn.execute("INSERT INTO DEPT(Code,Name,Budget)VALUES(99,'AI',112343);")
conn.execute("INSERT INTO DEPT(Code,Name,Budget)VALUES(07,'sports',1000);")
conn.commit()

In [32]:
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(1,'vic','roger',14,1000);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(2,'sky','dan',37,20000);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(3,'chase','p',59,3000);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(4,'rubble','smit',77,500);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(5,'jason','holder',23,999);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(6,'chase','warner',19,3000);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(7,'VK','M',99,991);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(8,'dan','chris',07,70000);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(9,'paw','pat',59,4000);")
conn.execute("INSERT INTO EMP(SSN,Name,Lname,Department,Salary)VALUES(10,'rider','huss',14,200);")
conn.commit()

In [43]:
 conn=sqlite3.connect("test.db")

In [44]:
cursor=conn.execute('''select*from DEPT''')
for row in cursor:
  print(row)

(7, 'sports', 1000.0)
(14, 'IT', 65000.0)
(19, 'DS', 115000.0)
(23, 'CSE', 222222.0)
(37, 'Accounting', 15000.0)
(59, 'HR', 240000.0)
(77, 'Research', 55000.0)
(99, 'AI', 112343.0)

In [45]:
cursor=conn.execute('''select*from EMP''')
for row in cursor:
  print(row)

(1, 'vic', 'roger', 14, 1000)
(2, 'sky', 'dan', 37, 20000)
(3, 'chase', 'p', 59, 3000)
(4, 'rubble', 'smit', 77, 500)
(5, 'jason', 'holder', 23, 999)
(6, 'chase', 'warner', 19, 3000)
(7, 'VK', 'M', 99, 991)
(8, 'dan', 'chris', 7, 70000)
(9, 'paw', 'pat', 59, 4000)
(10, 'rider', 'huss', 14, 200)

In [46]:

cursor=conn.execute('''select name from DEPT where code in (select department from EMP group by department having count(*)>2);''')
for row in cursor:
  print(row)

In [47]:
cursor=conn.execute('''select name,lname from EMP where salary >3000;''')
for row in cursor:
  print(row)

('sky', 'dan')
('dan', 'chris')
('paw', 'pat')

In [62]:
prompt = "EMP table has following fields SSN,name,lname, department,salary. write a query to display name and lname whose salary greater than 3000"

In [63]:
print(gpt.get_top_reply(prompt))

output: Select name,lname from Employee where salary>3000;

In [64]:
cursor=conn.execute('''Select name,lname from Emp where salary>3000;''')
for row in cursor:
  print(row)

('sky', 'dan')
('dan', 'chris')
('paw', 'pat')